<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of HP Printer Drives and copies a package.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.pkg.HPPrinterDrivers</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.HP.HPPrinterDrivers</string>
		<key>NAME</key>
		<string>HPPrinterDrivers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.HPPrinterDrivers</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Comment</key>
            <string>Copy the pkg with jss_importer friendly name.</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
	</array>
</dict>
</plist>w
