<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Arduino and copies it into your SCCM Server.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.sccm.googledrivefilestream</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>googledrivefilestream</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.pkg.googledrivefilestream</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_directory</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>source_file</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.cgerke-recipes.SharedProcessors/CmmacCreator</string>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/autopkg/cgerke-recipes</string>
		</dict>
	</array>
</dict>
</plist>
