<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>scratch 2 requires adobe air</string>
	<key>Description</key>
	<string>Downloads the latest version of Scratch2 and deploys to computer.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.pkg.scratch2</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>edu.media.mit.Scratch2Editor</string>
		<key>NAME</key>
		<string>Scratch 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.download.scratch2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install Scratch 2.app/Contents/Resources/Scratch 2</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "edu.media.mit.Scratch2Editor" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W7AR3WMP87</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>packager</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
