<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Scratch2 and deploys to computer.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.pkg.Scratch2<</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>edu.media.mit.Scratch2Editor</string>
		<key>NAME</key>
		<string>Scratch2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.aysiu.download.Scratch2</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Comment</key>
            <string>Copy the embedded package out of the application bundle in the disk image.</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Install\ Scratch\ 2/Install\ Scratch\ 2.app/Contents/Resources/Scratch\ 2</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
	</array>
</dict>
</plist>
