<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MalwareBytes Nebula.
URL for download is from
https://service.malwarebytes.com/hc/en-us/articles/16733851276563-Download-and-install-the-Nebula-endpoint-agent-with-a-generic-installer
	</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.download.MalwareBytesNebula</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MalwareBytesNebula</string>
		<key>url</key>
		<string>https://ark.mwbsys.com/epa.mac.installer/release</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Malwarebytes Corporation (GVZRY6KDKR)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
          <key>Processor</key>
          <string>pkgutilExpandFullProvider</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/MBBRNebulaAgentInstaller.pkg/Payload/Library/Application\ Support/Malwarebytes/Malwarebytes\ Endpoint\ Agent/EndpointAgentDaemon.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>