<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MalwareBytes Nebula.
input MalwareBytesNebula_URL should be set as a shell variable
set with 'set MalwareBytesNebula_URL="your_URL_HERE"'
test variable in terminal with 'echo $MalwareBytesNebula_URL' 
you can get your URL from the nebula console in the download center, use the direct download URL for macOS.
	</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.download.MalwareBytesNebula</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MalwareBytesNebula</string>
		<key>LANDING</key>
		<string>%MalwareBytesNebula_URL%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
	    <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%LANDING%</string>
                <key>re_pattern</key>
                <string>https:\/\/nebula-agent-installers-mb-prod\.s3\.amazonaws\.com\/[A-Z,a-z,0-9,\-,\=,\&,\%,\_,\.,\?]*</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Malwarebytes Corporation (GVZRY6KDKR)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/</string>
				<key>purge_destination</key>
				<true/>
			</dict>
          <key>Processor</key>
          <string>pkgutilExpandFullProvider</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/MBBRNebulaAgentInstaller.pkg/Payload/Library/Application\ Support/Malwarebytes/Malwarebytes\ Endpoint\ Agent/EndpointAgentDaemon.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>