<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of HPPrinterDrivers directly from HP and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.jamf.WebexCiscoAudioDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>WebexCiscoAudioDriver</string>
        <key>CATEGORY</key>
		<string>Webex</string>
        <key>PKG_CATEGORY</key>
        <string>%CATEGORY%</string>
        <key>STOPPROCESSINGIF_PREDICATE</key>
        <string>download_changed == FALSE</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.pkg.WebexCiscoAudioDriver</string>
	<key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>category_name</key>
               <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_category</key>
               <string>%PKG_CATEGORY%</string>
               <key>pkg_notes</key>
               <string>%NAME% %version% installer uploaded via AutoPkg.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
         </dict>
      </array>
	</dict>
</plist>
