<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive Backup and Sync and copies it into your LANrev Server.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.lanrev.googledrivebackupandsync</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>googledrivebackupandsync</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.pkg.googledrivebackupandsync</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dest_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.amsdpackages</string>
				<key>import_pkg_to_servercenter</key>
				<true/>
				<key>sdpackages_ampkgprops_path</key>
				<string>%RECIPE_DIR%/%NAME%-Defaults.ampkgprops</string>
				<key>source_payload_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jbaker10.LANrevImporter/LANrevImporter</string>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/jbaker10/LANrevImporter</string>
		</dict>
	</array>
</dict>
</plist>
