<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.pkg.GoogleDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GoogleDrive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.download.GoogleDrive</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Comment</key>
            <string>Create a renamed copy of the pkg</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/GoogleDrive.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgcopier/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
	</array>
</dict>
</plist>
