<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.allworkandnoplay.jamf.GoogleDrive</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>GoogleDrive</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Online backup to Google Drive, Amazon Glacier, SFTP.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>POLICY_NAME</key>
		<string>%SITE% %NAME% Latest</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest-site-group.xml</string>
		<key>SITE</key>
		<string>IAML</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.allworkandnoplay.pkg.GoogleDrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>pkg_uploaded == False</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>replace_policy</key>
				<string>True</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
