<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1"><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>Configuration</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>bp</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>PayloadRemovalDisallowed</key><true/><key>PayloadScope</key><string>System</string><key>PayloadContent</key><array><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.MCX</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>MCX</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>DestroyFVKeyOnStandby</key><false/><key>dontAllowFDEDisable</key><false/></dict><dict><key>PayloadUUID</key><string>FREDDICATED</string><key>PayloadType</key><string>com.apple.SubmitDiagInfo</string><key>PayloadOrganization</key><string>Chadwick School</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>Security And Privacy</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>AutoSubmit</key><true/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.systempolicy.managed</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>SystemPolicyManaged</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>DisableOverride</key><true/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.preference.security</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>PreferenceSecurity</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>dontAllowPasswordResetUI</key><true/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.screensaver</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>Login Window:  Screen Saver Preferences</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>askForPassword</key><true/><key>askForPasswordDelay</key><integer>0</integer></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.loginwindow</string><key>PayloadOrganization</key><string>Chadwick School</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>Login Window</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>ChangePasswordDisabled</key><true/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.applicationaccess</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>Restrictions</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>allowDiagnosticSubmission</key><true/><key>allowAutoUnlock</key><false/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.security.firewall</string><key>PayloadOrganization</key><string>REDDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>Firewall</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>EnableFirewall</key><false/><key>BlockAllIncoming</key><false/><key>EnableStealthMode</key><false/><key>Applications</key><array/></dict><dict><key>PayloadUUID</key><string>REDDICATED</string><key>PayloadType</key><string>com.apple.systempolicy.control</string><key>PayloadOrganization</key><string>REDCDICATED</string><key>PayloadIdentifier</key><string>REDDICATED</string><key>PayloadDisplayName</key><string>SystemPolicyControl</string><key>PayloadDescription</key><string/><key>PayloadVersion</key><integer>1</integer><key>PayloadEnabled</key><true/><key>AllowIdentifiedDevelopers</key><true/><key>EnableAssessment</key><true/></dict></array></dict></plist>